---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.#ctor
source: html/db9d6a75-8b04-fbe5-c036-6eba20cd8cd3.htm
---
# Autodesk.Revit.DB.Electrical.ElectricalDemandFactorDefinition.#ctor Method

Constructs a new ElectricalDemandFactorDefinition with default settings.

## Syntax (C#)
```csharp
public ElectricalDemandFactorDefinition()
```